robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA_Inverter.cpp
#include "ESP32_SMA_Inverter.h"

#include "bluetooth.h"
#include "SMANetArduino.h"
#include "LocalUtil.h"
#include "mainstate.h"

#include <ets-appender.hpp>
#include <udp-appender.hpp>

#include "site_details.h"

// SMA "no data / inverter idle" sentinels. The inverter substitutes these
// for any spot value it can't currently produce (typically at night when the
// DSP/MPPT is offline). Returning them as raw integers poisons HA history
// (e.g. instant_ac = -2147483648 W). Filter at every parse site.
static inline bool isValidSpotValue(uint32_t v) {
  return v != 0x80000000UL && v != 0xFFFFFFFFUL;
}

// Dump up to `count` bytes from `buf` as space-separated hex with `tag` prefix.
// Used to diagnose responses that fail the L2-frame check (e.g. the DC query
// reply on a SunnyBoy that doesn't return PPP-framed data). Uses log_i (ESP-IDF
// macro) rather than the class-level logI so it can run from a free function;
// ESP32_SMA::setup() hooks ESP-IDF logs into the same UDP appender.
static void logHexDump(const char* tag, const unsigned char* buf, int count)
{
  if (count <= 0) { log_i("%s [0 bytes]:", tag); return; }
  if (count > 120) count = 120; // packet buffer max
  char line[3 * 121 + 1];
  int pos = 0;
  for (int i = 0; i < count; i++) {
    pos += snprintf(line + pos, sizeof(line) - pos, "%02X ", buf[i]);
    if (pos >= (int)sizeof(line) - 4) break;
  }
  if (pos > 0 && line[pos - 1] == ' ') line[pos - 1] = '\0';
  log_i("%s [%d bytes]: %s", tag, count, line);
}

bool ESP32_SMA_Inverter::initialiseSMAConnection()
{
  logD("initialiseSMAConnection(%i) ", innerstate);


  unsigned char netid;
  switch (innerstate)
  {
  case 0:
  logD("AC: send request");
    //Wait for announcement/broadcast message from PV inverter
    if (getPacket(0x0002))
      innerstate++;
    break;

  case 1:
  logD("AC: waiting multi-packet");
    //Extract data from the 0002 packet
    netid = level1packet[4];

    // Now create a response and send it.
    for (int i = 0; i < sizeof(level1packet); i++)
      level1packet[i] = 0x00;

    writePacketHeader(level1packet, 0x02, 0x00, smaBTInverterAddressArray);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packet99, sizeof_smanet2packet99 );
    writeSMANET2SingleByte(level1packet, netid);
    writeSMANET2ArrayFromProgmem(level1packet, fourzeros, sizeof_fourzeros );
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packet0x01000000, sizeof(smanet2packet0x01000000));
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 2:
  logD("AC: parse response");
    // The SMA inverter will respond with a packet carrying the command '0x000A'.
    // It will return with cmdcode set to 0x000A.
    if (getPacket(0x000a))
      innerstate++;
    break;

  case 3:
    // The SMA inverter will now send two packets, one carrying the '0x000C' command, then the '0x0005' command.
    // Sit in the following loop until you get one of these two packets.
    cmdcode = readLevel1PacketFromBluetoothStream(0);
    if ((cmdcode == 0x000c) || (cmdcode == 0x0005))
      innerstate++;
    else if (cmdcode == 0xFFFF) {
      // transient failure, retry from case 2 next loop
      innerstate = 2;
    }
    break;

  case 4:
    // If the most recent packet was command code = 0x0005 skip this next line, otherwise, wait for 0x0005 packet.
    // Since the first SMA packet after a 0x000A packet will be a 0x000C packet, you'll probably sit here waiting at least once.
    if (cmdcode == 0x0005)
    {
      innerstate++;
    }
    else
    {
      if (getPacket(0x0005))
        innerstate++;
    }
    break;

  case 5:
    //First SMANET2 packet
    writePacketHeader(level1packet, sixff);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xa0, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof_smanet2packetx80x00x02x00);
    writeSMANET2SingleByte(level1packet, 0x00);
    writeSMANET2ArrayFromProgmem(level1packet, fourzeros, sizeof_fourzeros);
    writeSMANET2ArrayFromProgmem(level1packet, fourzeros, sizeof_fourzeros);
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);

    if (getPacket(0x0001) && validateChecksum())
    {
      innerstate++;
      packet_send_counter++;
    }
    else if (cmdcode == 0xFFFF) {
      innerstate = 5; // retry sending first packet
    }
    break;

  case 6:
    //Second SMANET2 packet
    writePacketHeader(level1packet, sixff);
    writeSMANET2PlusPacket(level1packet, 0x08, 0xa0, packet_send_counter, 0x00, 0x03, 0x03);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packet2, sizeof_smanet2packet2);

    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    packet_send_counter++;

    innerstate++;
    break;

  default:
    return true;
  }

  return false;
}




bool ESP32_SMA_Inverter::logonSMAInverter()
{
  logD("logonSMAInverter(%i)" , innerstate);

  //Third SMANET2 packet
  switch (innerstate)
  {
  case 0:
  logD("DC: send request");
    writePacketHeader(level1packet, sixff);
    writeSMANET2PlusPacket(level1packet, 0x0e, 0xa0, packet_send_counter, 0x00, 0x01, 0x01);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packet_logon, sizeof(smanet2packet_logon));
    writeSMANET2ArrayFromProgmem(level1packet, fourzeros, sizeof_fourzeros);

    //INVERTER PASSWORD
    for (int passcodeloop = 0; passcodeloop < sizeof(SMAInverterPasscode); passcodeloop++)
    {
      unsigned char v = pgm_read_byte(SMAInverterPasscode + passcodeloop);
      writeSMANET2SingleByte(level1packet, (v + 0x88) % 0xff);
    }

    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);

    innerstate++;
    break;

  case 1:
  logD("DC: waiting multi-packet");
    if (getPacket(0x0001) && validateChecksum())
    {
      innerstate++;
      packet_send_counter++;
    }
    else if (cmdcode == 0xFFFF) {
      innerstate = 6; // retry
    }
    break;

  default:
    return true;
  }

