robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA_Inverter.cpp
  return false;
}



bool ESP32_SMA_Inverter::getDailyYield()
{
  //We expect a multi packet reply to this question...
  //We ask the inverter for its DAILY yield (generation)
  //once this is returned we can extract the current date/time from the inverter and set our internal clock
  logD("getDailyYield(%i)" , innerstate);

  switch (innerstate)
  {
  case 0:
    writePacketHeader(level1packet);
    //writePacketHeader(level1packet,0x01,0x00,smaBTInverterAddressArray);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xa0, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packet6, sizeof(smanet2packet6));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);

    sendPacket(level1packet);

    innerstate++;
    break;

  case 1:
    if (getPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    break;

  case 2:
  logD("DC: parse response");
    //Returns packet looking like this...
    //    7E FF 03 60 65 0D 90 5C AF F0 1D 50 00 00 A0 83
    //    00 1E 6C 5D 7E 00 00 00 00 00 00 03
    //    80 01 02 00
    //    54 01 00 00 00 01 00 00 00 01
    //    22 26  //command code 0x2622 daily yield
    //    00     //unknown
    //    D6 A6 99 4F  //Unix time stamp (backwards!) = 1335469782 = Thu, 26 Apr 2012 19:49:42 GMT
    //    D9 26 00     //Daily generation 9.945 kwh
    //    00
    //    00 00 00 00
    //    18 61    //checksum
    //    7E       //packet trailer

    // Does this packet contain the British Summer time flag?
    //dumpPacket('Y');

    valuetype = level1packet[40 + 1 + 1] + level1packet[40 + 2 + 1] * 256;

    //Serial.println(valuetype,HEX);
    //Make sure this is the right message type
    if (valuetype == 0x2622)
    {
      memcpy(&value64, &level1packet[40 + 8 + 1], 8);
      //0x2622=Day Yield Wh
      // memcpy(&datetime, &level1packet[40 + 4 + 1], 4);
      datetime = LocalUtil::get_long(level1packet + 40 + 1 + 4);
      // debugMsg("Current Time (epoch): ");
      // debugMsgLn(String(datetime));

      //setTime(datetime);
      currentvalue = value64;
      logI("Day Yield: %f" , (double)value64 / 1000);
      _client.publish(MQTT_BASE_TOPIC "generation_today", LocalUtil::uint64ToString(currentvalue), true);


      if (1==0) {
        if (!_client.isConnected() ){
            log_i("_client not connected here ");
        } else {
            log_i("_client is connected here ");
        }
      }

    }
    innerstate++;
    break;

  default:
    return true;
  }

  return false;
}


bool ESP32_SMA_Inverter::getInstantACPower()
{
  logD("getInstantACPower(%i)" , innerstate);

  int32_t thisvalue;
  //Get spot value for instant AC wattage
  // debugMsg("getInstantACPower stage: ");
  // debugMsgLn(String(innerstate));

  switch (innerstate)
  {
  case 0:
    writePacketHeader(level1packet); //writePacketHeader(pcktBuf, 0x01, addr_unknown);
    //writePacketHeader(level1packet,0x01,0x00,smaBTInverterAddressArray);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xA1, packet_send_counter, 0, 0, 0); // writePacket(pcktBuf, 0x09, 0xA0, 0, device->SUSyID, device->Serial);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2acspotvalues, sizeof(smanet2acspotvalues));
    writeSMANET2PlusPacketTrailer(level1packet); //writePacketTrailer(pcktBuf);
    writePacketLength(level1packet); //writePacketLength(pcktBuf);

    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    else {
      // timeout, retry request next loop
      innerstate = 0;
    }
    break;

  case 2:
    // Loop through all value types in the packet
    {
      bool found_ac = false;
      for (int i = 40 + 1; i < packetposition - 3; i += 28) {
        valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
        memcpy(&value, &level1packet[i + 8], 4);
        memcpy(&datetime, &level1packet[i + 4], 4);
        if (valuetype == 0x263f) { // Total AC power
          if (!isValidSpotValue(value)) {
            logI("AC Pwr Total: inverter idle (sentinel 0x%08lX), skipping", (unsigned long)value);
            found_ac = true; // suppress fallback path below
            continue;
          }
          currentvalue = value;
          logI("AC Pwr Total= %li ", value);
          _client.publish(MQTT_BASE_TOPIC "instant_ac", LocalUtil::uint64ToString(currentvalue), true);
          _client.publish(MQTT_BASE_TOPIC "inv_time", String(datetime), true);
          spotpowerac = currentvalue;
          found_ac = true;

          // Software-tracked daily peak. There is no SMA LRI for "max Pac today",
          // so derive it from the running AC total. Reset at local-midnight rollover.
          time_t now_local = esp32rtc.getEpoch();
          struct tm tm_local; localtime_r(&now_local, &tm_local);
          if (tm_local.tm_yday != maxpowertoday_yday) {
            maxpowertoday = 0;
            maxpowertoday_yday = tm_local.tm_yday;
          }
          if (value > (long)maxpowertoday) {
            maxpowertoday = (unsigned long)value;
            _client.publish(MQTT_BASE_TOPIC "max_power_today", String(maxpowertoday), true);
          }
        } else if (valuetype == 0x4640) { // PAC1
          if (!isValidSpotValue(value)) continue;
          logI("AC Pwr L1= %li ", value);
          _client.publish(MQTT_BASE_TOPIC "pac1", LocalUtil::uint64ToString(value), true);
        } else if (valuetype == 0x4641) { // PAC2
          if (!isValidSpotValue(value)) continue;
          logI("AC Pwr L2= %li ", value);
          _client.publish(MQTT_BASE_TOPIC "pac2", LocalUtil::uint64ToString(value), true);
        } else if (valuetype == 0x4642) { // PAC3
          if (!isValidSpotValue(value)) continue;
          logI("AC Pwr L3= %li ", value);
          _client.publish(MQTT_BASE_TOPIC "pac3", LocalUtil::uint64ToString(value), true);
        }
      }
      if (!found_ac) {
        // Fallback to old method
        datetime = LocalUtil::get_long(level1packet + 40 + 1 + 4);
        thisvalue = LocalUtil::get_long(level1packet + 40 + 1 + 8);
        if (!isValidSpotValue((uint32_t)thisvalue)) {
          logI("AC Pwr (fallback): inverter idle (sentinel 0x%08lX), skipping", (unsigned long)thisvalue);
        } else {
          currentvalue = thisvalue;
          logI("AC Pwr= %li ", thisvalue);
          _client.publish(MQTT_BASE_TOPIC "instant_ac", LocalUtil::uint64ToString(currentvalue), true);
          _client.publish(MQTT_BASE_TOPIC "inv_time", String(datetime), true);
          spotpowerac = thisvalue;
        }
      }
    }
    innerstate++;
    break;

  default:
    return true;
  }

