robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA_Inverter.cpp
  return false;
}

bool ESP32_SMA_Inverter::getTotalPowerGeneration()
{

  //Gets the total kWh the SMA inverter has generated in its lifetime...
  // debugMsg("getTotalPowerGeneration stage: ");
  // debugMsgLn(String(innerstate));
  logD("getTotalPowerGeneration(%i)" , innerstate);

  switch (innerstate)
  {
  case 0:
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xa0, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2totalyieldWh, sizeof(smanet2totalyieldWh));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);

    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    else {
      innerstate = 0;
    }
    break;

  case 2:
    //displaySpotValues(16);
    memcpy(&datetime, &level1packet[40 + 1 + 4], 4);
    memcpy(&value64, &level1packet[40 + 1 + 8], 8);
    //digitalClockDisplay(datetime);
    currentvalue = value64;
    logI("Total Power: %f ", (double)value64 / 1000);
    //reportValue(MQTT_BASE_TOPIC "generation_total", LocalUtil::uint64ToString(currentvalue), true);
    _client.publish(MQTT_BASE_TOPIC "generation_total", LocalUtil::uint64ToString(currentvalue), true);
    innerstate++;
    break;

  default:
    return true;
  }

  return false;
}

// DC Power query mode. SunnyBoys vary in which LRI block they expose for Pdc:
//   primary  = SBFspot's SpotDCPower    (LRI 0x251E)
//   alt      = SBFspot's SpotDCPower_2  (LRI 0x451E)
//   disabled = both queries returned an error frame, skip until reboot
// Sticky for the runtime; reset on power-cycle.
enum DCPowerMode { DCP_TRY_PRIMARY = 0, DCP_TRY_ALT = 1, DCP_DISABLED = 2 };
static DCPowerMode gDCPowerMode = DCP_TRY_PRIMARY;

// Walk the response body looking for a record header that matches one of the
// allowed LRI low/mid bytes. Records are 28 bytes wide and start with
// [cls][lri-low][lri-mid][dataType] where cls is the string number (1 or 2).
// Returns the offset of the first matching header, or -1 if none found.
static int findFirstRecordOffset(const unsigned char *buf, int len,
                                 uint8_t lri_lo_a, uint8_t lri_mid,
                                 uint8_t lri_lo_b)
{
  for (int j = 0; j + 28 <= len - 3; j++) {
    uint8_t c = buf[j + 0];
    uint8_t a = buf[j + 1];
    uint8_t b = buf[j + 2];
    uint8_t d = buf[j + 3];
    if ((c == 0x01 || c == 0x02) && b == lri_mid &&
        (a == lri_lo_a || a == lri_lo_b) && (d == 0x40 || d == 0xC0)) {
      return j;
    }
  }
  return -1;
}

bool ESP32_SMA_Inverter::getInstantDCPower()
{
#ifndef FETCH_DC_INSTANT_POWER
  return true;
#else
  logD("getInstantDCPower(%i)", innerstate);

  // Two SBFspot-style queries chained together so we get Pdc and Udc/Idc:
  //   states 0..2 = SpotDCPower    (LRI 0x251E or 0x451E)     -> pdc1/pdc2
  //   states 3..5 = SpotDCVoltage  (LRI 0x451F + 0x4521)      -> udc/idc per string
  // Each phase has a hard timeout: if the inverter doesn't respond we skip
  // forward instead of spinning back to state 0 (previously caused a watchdog
  // reboot on inverters that ignore the DC query).
  static unsigned long phaseStartMs = 0;
  static unsigned long pdc1_acc = 0, pdc2_acc = 0;
  static float vdc1_acc = 0, vdc2_acc = 0, adc1_acc = 0, adc2_acc = 0;
  const unsigned long PHASE_TIMEOUT_MS = 4000;

  switch (innerstate)
  {
  case 0:
    pdc1_acc = pdc2_acc = 0;
    vdc1_acc = vdc2_acc = adc1_acc = adc2_acc = 0;
    if (gDCPowerMode == DCP_DISABLED) {
      // Inverter doesn't expose Pdc via either LRI block. Skip the query
      // entirely; the Udc/Idc phase below still runs and we derive P=U*I.
      innerstate = 3;
      break;
    }
    phaseStartMs = millis();
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xA1, packet_send_counter, 0, 0, 0);
    // smanet2packetdcpower / _2 have the {0x80,0x00,0x02,0x80} prefix baked in,
    // so the shared smanet2packetx80x00x02x00 prefix MUST NOT be prepended here.
    if (gDCPowerMode == DCP_TRY_PRIMARY) {
      writeSMANET2ArrayFromProgmem(level1packet, smanet2packetdcpower,   sizeof_smanet2packetdcpower);
    } else {
      writeSMANET2ArrayFromProgmem(level1packet, smanet2packetdcpower_2, sizeof_smanet2packetdcpower_2);
    }
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    if (millis() - phaseStartMs > PHASE_TIMEOUT_MS) {
      logW("DC Power phase timeout - moving on");
      innerstate = 3; // skip parse, try DC voltage phase
      break;
    }
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
      {
        // SunnyBoy 4000US returns DC responses with a short header instead of
        // the usual PPP frame, so containsLevel2Packet() rejects them. Scan
        // for the first valid record header (cls=1|2, lri matches expected).
        // The expected LRI low byte for Pdc is 0x1E with mid byte 0x25 (primary)
        // or 0x45 (alt fallback).
        logW("DC Power: PPP frame check failed, attempting short-frame parse");
        logHexDump("DC Power raw body", level1packet, packetposition);

        const uint8_t lri_mid = (gDCPowerMode == DCP_TRY_PRIMARY) ? 0x25 : 0x45;
        const uint16_t lri_expected = (uint16_t)0x1E | ((uint16_t)lri_mid << 8);
        int start = findFirstRecordOffset(level1packet, (int)packetposition,
                                          0x1E, lri_mid, 0x1E);
        if (start < 0) {
          // No records at all - likely an error frame from the inverter.
          if (gDCPowerMode == DCP_TRY_PRIMARY) {
            logW("DC Power 0x251E unsupported on this inverter, falling back to 0x451E");
            gDCPowerMode = DCP_TRY_ALT;
          } else {
            logW("DC Power 0x451E also unsupported, disabling DC Power query until reboot");
            gDCPowerMode = DCP_DISABLED;
          }
        } else {
          for (int i = start; i + 28 <= (int)packetposition - 3; i += 28) {
            valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
            memcpy(&value, &level1packet[i + 8], 4);
            uint8_t cls = level1packet[i + 0];
            if (cls != 1 && cls != 2) break; // ran off the end of records
            logI("DC Pdc short-frame: cls=%u lri=0x%04X value=%lu", cls, valuetype, value);
            if (valuetype != lri_expected) continue;
            if (!isValidSpotValue(value)) continue;
            if (cls == 1) pdc1_acc = value;
            else if (cls == 2) pdc2_acc = value;
          }
        }
        innerstate = 3;
      }
    }
    // else: fall through and try again until timeout
    break;

