robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA_Inverter.cpp
  case 2:
    for (int i = 40 + 1; i + 28 <= packetposition - 3; i += 28)
    {
      valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
      memcpy(&value, &level1packet[i + 8], 4);
      uint8_t cls = level1packet[i + 0];

      logD("DC Pdc record: cls=%u valuetype=0x%04X value=%lu", cls, valuetype, value);

      // Accept whichever LRI variant we're currently trying. If the inverter
      // answers cleanly via PPP we treat that as the active variant working.
      uint16_t lri_expected = (gDCPowerMode == DCP_TRY_ALT) ? 0x451E : 0x251E;
      if (valuetype == lri_expected) {
        if (!isValidSpotValue(value)) continue;
        if (cls == 1) pdc1_acc = value;
        else if (cls == 2) pdc2_acc = value;
      }
      memcpy(&datetime, &level1packet[i + 4], 4);
    }
    innerstate++;
    break;

  case 3:
    phaseStartMs = millis();
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xA1, packet_send_counter, 0, 0, 0);
    // smanet2packetdcvoltage also bakes the {0x80,0x00,0x02,0x80} prefix in.
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetdcvoltage, sizeof_smanet2packetdcvoltage);
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 4:
    if (millis() - phaseStartMs > PHASE_TIMEOUT_MS) {
      logW("DC Voltage phase timeout - moving on");
      innerstate = 6; // skip to publish
      break;
    }
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
      {
        // Same short-frame fallback for the DC Voltage phase. Locate the first
        // valid record header (cls=1|2, lri-low=0x1F or 0x21, lri-mid=0x45)
        // rather than assuming a fixed offset; otherwise variable leading
        // garbage (66/67/68 byte bodies seen in the wild) misaligns parsing.
        logW("DC Voltage: PPP frame check failed, attempting short-frame parse");
        logHexDump("DC Voltage raw body", level1packet, packetposition);

        int start = findFirstRecordOffset(level1packet, (int)packetposition,
                                          0x1F, 0x45, 0x21);
        if (start < 0) {
          logW("DC Voltage: short-frame parse - no record header found");
        } else {
          for (int i = start; i + 28 <= (int)packetposition - 3; i += 28) {
            valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
            memcpy(&value, &level1packet[i + 8], 4);
            uint8_t cls = level1packet[i + 0];
            if (cls != 1 && cls != 2) break;
            logI("DC Udc/Idc short-frame: cls=%u lri=0x%04X value=%lu", cls, valuetype, value);
            if (!isValidSpotValue(value)) continue;
            if (valuetype == 0x451f) {
              if (cls == 1) vdc1_acc = (float)value / 100.0f;
              else if (cls == 2) vdc2_acc = (float)value / 100.0f;
            } else if (valuetype == 0x4521) {
              if (cls == 1) adc1_acc = (float)value / 1000.0f;
              else if (cls == 2) adc2_acc = (float)value / 1000.0f;
            }
          }
        }
        innerstate = 6;
      }
    }
    break;

  case 5:
    for (int i = 40 + 1; i + 28 <= packetposition - 3; i += 28)
    {
      valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
      memcpy(&value, &level1packet[i + 8], 4);
      uint8_t cls = level1packet[i + 0];

      logD("DC Udc/Idc record: cls=%u valuetype=0x%04X value=%lu", cls, valuetype, value);

      if (!isValidSpotValue(value)) continue;
      if (valuetype == 0x451f) {
        if (cls == 1) vdc1_acc = (float)value / 100.0f;
        else if (cls == 2) vdc2_acc = (float)value / 100.0f;
      } else if (valuetype == 0x4521) {
        if (cls == 1) adc1_acc = (float)value / 1000.0f;
        else if (cls == 2) adc2_acc = (float)value / 1000.0f;
      }
      memcpy(&datetime, &level1packet[i + 4], 4);
    }
    innerstate++;
    break;

  case 6:
    {
      // Aggregate and publish whatever we managed to collect this cycle.
      spotpowerdc = pdc1_acc + pdc2_acc;
      spotvoltdc  = (vdc1_acc > 0 && vdc2_acc > 0) ? (vdc1_acc + vdc2_acc) / 2.0f
                   : (vdc1_acc > 0 ? vdc1_acc : vdc2_acc);
      spotampdc   = adc1_acc + adc2_acc;

      // If the inverter didn't return Pdc records (common with the short-frame
      // DC response on some SunnyBoys) but did return U and I, derive P=U*I.
      // Also guard against implausibly-large reported values.
      if (spotpowerdc == 0 || spotpowerdc > MAX_SPOTDC) {
        if (spotvoltdc > 0 && spotampdc > 0) {
          spotpowerdc = (unsigned long)(spotvoltdc * spotampdc);
        }
      }

      logI("DC Pwr=%lu Volt=%.2f Amp=%.3f", spotpowerdc, spotvoltdc, spotampdc);

      // Only publish DC totals/per-string when we actually collected a value.
      // Avoids overwriting HA history with 0 on a cycle where the inverter
      // refused to answer (or is asleep).
      if (spotpowerdc > 0) _client.publish(MQTT_BASE_TOPIC "instant_dc",  String(spotpowerdc), true);
      if (spotvoltdc  > 0) _client.publish(MQTT_BASE_TOPIC "instant_vdc", String(spotvoltdc),  true);
      if (spotampdc   > 0) _client.publish(MQTT_BASE_TOPIC "instant_adc", String(spotampdc),   true);
      if (vdc1_acc > 0) _client.publish(MQTT_BASE_TOPIC "instant_vdc1", String(vdc1_acc), true);
      if (vdc2_acc > 0) _client.publish(MQTT_BASE_TOPIC "instant_vdc2", String(vdc2_acc), true);
      if (adc1_acc > 0) _client.publish(MQTT_BASE_TOPIC "instant_adc1", String(adc1_acc), true);
      if (adc2_acc > 0) _client.publish(MQTT_BASE_TOPIC "instant_adc2", String(adc2_acc), true);
      if (pdc1_acc > 0) _client.publish(MQTT_BASE_TOPIC "instant_pdc1", String(pdc1_acc), true);
      if (pdc2_acc > 0) _client.publish(MQTT_BASE_TOPIC "instant_pdc2", String(pdc2_acc), true);
    }
    innerstate++;
    break;

  default:
    return true;
  }

  return false;
#endif
}



