robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA_Inverter.cpp
  case 2:
    {
      // Extract grid frequency (value type 0x4657)
      bool found_frequency = false;
      for (int i = 40 + 1; i < packetposition - 3; i += 28)
      {
        valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
        memcpy(&value, &level1packet[i + 8], 4);

        logD("Grid Frequency packet: valuetype=0x%04X, value=%ld", valuetype, value);

        if (valuetype == 0x4657) // Grid frequency
        {
          if (!isValidSpotValue(value)) {
            logI("Grid Freq: inverter idle (sentinel 0x%08lX), skipping", (unsigned long)value);
            found_frequency = true; // suppress not-found warning
            break;
          }
          gridfrequency = (float)value / 100.0; // Frequency in Hz
          // Sanity check - grid frequency should be between 45-65 Hz
          if (gridfrequency < 45.0 || gridfrequency > 65.0) {
            logW("Grid frequency out of range: %f Hz (expected 45-65 Hz), skipping", gridfrequency);
            found_frequency = true;
            break;
          }
          logI("Grid Freq: %f Hz", gridfrequency);
          _client.publish(MQTT_BASE_TOPIC "grid_frequency", String(gridfrequency), true);
          found_frequency = true;
          break;
        }
      }
      if (!found_frequency) {
        logW("Grid frequency data type 0x4657 not found in packet");
        // Debug: dump all value types found
        logW("Available value types in grid frequency packet:");
        for (int i = 40 + 1; i < packetposition - 3; i += 28) {
          valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
          memcpy(&value, &level1packet[i + 8], 4);
          logW("  0x%04X = %ld", valuetype, value);
        }
      }
      innerstate++;
      break;
    }

  default:
    return true;
  }
  return false;
}

bool ESP32_SMA_Inverter::getGridVoltage()
{
  logD("getGridVoltage(%i)", innerstate);
  
  static unsigned long functionStartTime = 0;
  
  switch (innerstate)
  {
  case 0:
    functionStartTime = millis(); // Start timeout timer
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xA1, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2gridvoltage, sizeof(smanet2gridvoltage));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    // Check for timeout first
    if (millis() - functionStartTime > 10000) { // 10 second timeout
      logW("getGridVoltage timeout after 10s - skipping");
      functionStartTime = 0;
      return true; // Skip this function and continue
    }
    
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    break;

  case 2:
    {
      // Extract grid voltage (value type 0x4648)
      bool found_voltage = false;
      for (int i = 40 + 1; i < packetposition - 3; i += 28)
      {
        valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
        memcpy(&value, &level1packet[i + 8], 4);

        logD("Grid Voltage packet: valuetype=0x%04X, value=%ld", valuetype, value);

        if (valuetype == 0x4648) // Grid voltage (phase A)
        {
          if (!isValidSpotValue(value)) {
            logI("Grid Voltage L1: inverter idle (sentinel 0x%08lX), skipping", (unsigned long)value);
            found_voltage = true;
            continue;
          }
          gridvoltage = (float)value / 100.0; // Voltage in V
          logI("Grid Voltage L1: %f V", gridvoltage);
          _client.publish(MQTT_BASE_TOPIC "grid_voltage", String(gridvoltage), true);
          found_voltage = true;
        } else if (valuetype == 0x4649) {
          if (!isValidSpotValue(value)) continue;
          float voltage = (float)value / 100.0;
          logI("Grid Voltage L2: %f V", voltage);
          _client.publish(MQTT_BASE_TOPIC "uac2", String(voltage), true);
        } else if (valuetype == 0x464A) {
          if (!isValidSpotValue(value)) continue;
          float voltage = (float)value / 100.0;
          logI("Grid Voltage L3: %f V", voltage);
          _client.publish(MQTT_BASE_TOPIC "uac3", String(voltage), true);
        }
      }
      if (!found_voltage) {
        logW("Grid voltage data type 0x4648 not found in packet");
        // Debug: dump all value types found
        logW("Available value types in grid voltage packet:");
        for (int i = 40 + 1; i < packetposition - 3; i += 28) {
          valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
          memcpy(&value, &level1packet[i + 8], 4);
          logW("  0x%04X = %ld", valuetype, value);
        }
      }
      innerstate++;
      break;
    }

  default:
    return true;
  }
  return false;
}

bool ESP32_SMA_Inverter::getInverterTemperature()
{
  logD("getInverterTemperature(%i)", innerstate);
  
  switch (innerstate)
  {
  case 0:
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xA1, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2temperature, sizeof(smanet2temperature));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    break;

  case 2:
    // Extract inverter temperature (value type 0x2377)
    for (int i = 40 + 1; i < packetposition - 3; i += 28)
    {
      valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
      memcpy(&value, &level1packet[i + 8], 4);
      
      if (valuetype == 0x2377) // Inverter temperature
      {
        if (!isValidSpotValue(value)) {
          logI("Inverter Temp: inverter idle (sentinel 0x%08lX), skipping", (unsigned long)value);
          break;
        }
        invertertemp = (float)value / 100.0; // Temperature in °C
        logI("Inverter Temp: %f °C", invertertemp);
        _client.publish(MQTT_BASE_TOPIC "inverter_temp", String(invertertemp), true);
        break;
      }
    }
    innerstate++;
    break;

  default:
    return true;
  }
  return false;
}

bool ESP32_SMA_Inverter::getMaxPowerToday()
{
  // SMA exposes no LRI for "max Pac today". The previous implementation queried
  // 0x2622 (Daily Yield) and published the Wh value as if it were Watts.
  // The peak is now tracked in software inside getInstantACPower(); this state
  // is kept as a no-op so the main state machine ordering is unchanged.
  return true;
}

