robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA_Inverter.cpp
// Extended metric functions
bool ESP32_SMA_Inverter::getACVoltage()
{
#ifndef FETCH_EXTENDED_AC_METRICS
  return true;
#else
  logD("getACVoltage(%i)", innerstate);
  
  switch (innerstate)
  {
  case 0:
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xA1, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2acvoltage, sizeof(smanet2acvoltage));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    break;

  case 2:
    {
  // Extract AC voltage (value type 0x4648)
      bool found_voltage = false;
      for (int i = 40 + 1; i < packetposition - 3; i += 28)
      {
        valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
        memcpy(&value, &level1packet[i + 8], 4);

  logD("AC Voltage packet: valuetype=0x%04X, value=%ld", valuetype, value);

  if (valuetype == 0x4648) // AC voltage (phase A)
        {
          if (!isValidSpotValue(value)) {
            logI("AC Voltage L1: inverter idle (sentinel 0x%08lX), skipping", (unsigned long)value);
            found_voltage = true;
            continue;
          }
          acvoltage = (float)value / 100.0; // Voltage in V
          logI("AC Voltage L1: %f V", acvoltage);
          _client.publish(MQTT_BASE_TOPIC "ac_voltage", String(acvoltage), true);
          found_voltage = true;
        } else if (valuetype == 0x4649) {
          if (!isValidSpotValue(value)) continue;
          float voltage = (float)value / 100.0;
          logI("AC Voltage L2: %f V", voltage);
          _client.publish(MQTT_BASE_TOPIC "uac2", String(voltage), true);
        } else if (valuetype == 0x464A) {
          if (!isValidSpotValue(value)) continue;
          float voltage = (float)value / 100.0;
          logI("AC Voltage L3: %f V", voltage);
          _client.publish(MQTT_BASE_TOPIC "uac3", String(voltage), true);
        }
      }
      if (!found_voltage) {
  logW("AC voltage data type 0x4648 not found in packet");
        // Debug: dump all value types found
        logW("Available value types in AC voltage packet:");
        for (int i = 40 + 1; i < packetposition - 3; i += 28) {
          valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
          memcpy(&value, &level1packet[i + 8], 4);
          logW("  0x%04X = %ld", valuetype, value);
        }
      }
      innerstate++;
      break;
    }

  default:
    return true;
  }
  return false;
#endif
}

bool ESP32_SMA_Inverter::getACCurrent()
{
#ifndef FETCH_EXTENDED_AC_METRICS
  return true;
#else
  logD("getACCurrent(%i)", innerstate);
  
  switch (innerstate)
  {
  case 0:
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xA1, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2accurrent, sizeof(smanet2accurrent));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    break;

  case 2:
    {
      // Extract AC current (value type 0x4650)
      bool found_current = false;
      for (int i = 40 + 1; i < packetposition - 3; i += 28)
      {
        valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
        memcpy(&value, &level1packet[i + 8], 4);

        logD("AC Current packet: valuetype=0x%04X, value=%ld", valuetype, value);

        if (valuetype == 0x4650) // AC current
        {
          if (!isValidSpotValue(value)) {
            logI("AC Current L1: inverter idle (sentinel 0x%08lX), skipping", (unsigned long)value);
            found_current = true;
            continue;
          }
          accurrent = (float)value / 1000.0; // Current in A
          logI("AC Current L1: %f A", accurrent);
          _client.publish(MQTT_BASE_TOPIC "ac_current", String(accurrent), true);
          found_current = true;
        } else if (valuetype == 0x4651) {
          if (!isValidSpotValue(value)) continue;
          float current = (float)value / 1000.0;
          logI("AC Current L2: %f A", current);
          _client.publish(MQTT_BASE_TOPIC "iac2", String(current), true);
        } else if (valuetype == 0x4652) {
          if (!isValidSpotValue(value)) continue;
          float current = (float)value / 1000.0;
          logI("AC Current L3: %f A", current);
          _client.publish(MQTT_BASE_TOPIC "iac3", String(current), true);
        }
      }
      if (!found_current) {
        logW("AC current data type 0x4650 not found in packet");
        // Debug: dump all value types found
        logW("Available value types in AC current packet:");
        for (int i = 40 + 1; i < packetposition - 3; i += 28) {
          valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
          memcpy(&value, &level1packet[i + 8], 4);
          logW("  0x%04X = %ld", valuetype, value);
        }
      }
      innerstate++;
      break;
    }

  default:
    return true;
  }
  return false;
#endif
}

bool ESP32_SMA_Inverter::getOperatingTime()
{
#ifndef FETCH_TIME_METRICS
  return true;
#else
  logD("getOperatingTime(%i)", innerstate);
  
  switch (innerstate)
  {
  case 0:
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xa0, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2operatingtime, sizeof(smanet2operatingtime));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    break;

