robbertdriessen/ESP32_to_SMA_ESPHome/src/ESP32_SMA_Inverter.cpp
  case 2:
    {
      // Extract operating time (value type 0x462E)
      bool found_optime = false;
      for (int i = 40 + 1; i < packetposition - 3; i += 28)
      {
        valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
        memcpy(&value, &level1packet[i + 8], 4);

        logD("Operating Time packet: valuetype=0x%04X, value=%ld", valuetype, value);

        if (valuetype == 0x462E) // Operating time
        {
          if (!isValidSpotValue(value)) {
            logI("Operating Time: inverter idle (sentinel 0x%08lX), skipping", (unsigned long)value);
            found_optime = true;
            break;
          }
          operatingtime = value / 3600; // Convert seconds to hours
          logI("Operating Time: %lu hours", operatingtime);
          _client.publish(MQTT_BASE_TOPIC "operating_time", String(operatingtime), true);
          found_optime = true;
          break;
        }
      }
      if (!found_optime) {
        logW("Operating time data type 0x462E not found in packet");
      }
      innerstate++;
      break;
    }

  default:
    return true;
  }
  return false;
#endif
}

bool ESP32_SMA_Inverter::getFeedInTime()
{
#ifndef FETCH_TIME_METRICS
  return true;
#else
  logD("getFeedInTime(%i)", innerstate);
  
  switch (innerstate)
  {
  case 0:
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xa0, packet_send_counter, 0, 0, 0);
    writeSMANET2ArrayFromProgmem(level1packet, smanet2packetx80x00x02x00, sizeof(smanet2packetx80x00x02x00));
    writeSMANET2ArrayFromProgmem(level1packet, smanet2feedintime, sizeof(smanet2feedintime));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    break;

  case 2:
    {
      // Extract feed-in time (value type 0x462F)
      bool found_feedtime = false;
      for (int i = 40 + 1; i < packetposition - 3; i += 28)
      {
        valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
        memcpy(&value, &level1packet[i + 8], 4);

        logD("Feed-in Time packet: valuetype=0x%04X, value=%ld", valuetype, value);

        if (valuetype == 0x462F) // Feed-in time
        {
          if (!isValidSpotValue(value)) {
            logI("Feed-in Time: inverter idle (sentinel 0x%08lX), skipping", (unsigned long)value);
            found_feedtime = true;
            break;
          }
          feedintime = value / 3600; // Convert seconds to hours
          logI("Feed-in Time: %lu hours", feedintime);
          _client.publish(MQTT_BASE_TOPIC "feedin_time", String(feedintime), true);
          found_feedtime = true;
          break;
        }
      }
      if (!found_feedtime) {
        logW("Feed-in time data type 0x462F not found in packet");
      }
      innerstate++;
      break;
    }

  default:
    return true;
  }
  return false;
#endif
}

bool ESP32_SMA_Inverter::getDeviceStatus()
{
#ifndef FETCH_STATUS_METRICS
  return true;
#else
  logD("getDeviceStatus(%i)", innerstate);
  
  static unsigned long functionStartTime = 0;
  
  switch (innerstate)
  {
  case 0:
    functionStartTime = millis(); // Start timeout timer
    writePacketHeader(level1packet);
    writeSMANET2PlusPacket(level1packet, 0x09, 0xA1, packet_send_counter, 0, 0, 0);
    // smanet2devicestatus already bakes in the {0x80,0x00,0x02,0x80} prefix
    // because its mask byte is 0x80; do NOT prepend smanet2packetx80x00x02x00.
    writeSMANET2ArrayFromProgmem(level1packet, smanet2devicestatus, sizeof(smanet2devicestatus));
    writeSMANET2PlusPacketTrailer(level1packet);
    writePacketLength(level1packet);
    sendPacket(level1packet);
    innerstate++;
    break;

  case 1:
    // Check for timeout first
    if (millis() - functionStartTime > 10000) { // 10 second timeout
      logW("getDeviceStatus timeout after 10s - skipping");
      functionStartTime = 0;
      return true; // Skip this function and continue
    }
    
    if (waitForMultiPacket(0x0001))
    {
      if (validateChecksum())
      {
        packet_send_counter++;
        innerstate++;
      }
      else
        innerstate = 0;
    }
    break;

  case 2:
    {
      // Status records (OperationHealth 0x2148) are 40 bytes long. Each record's
      // bytes [+8..+36] hold up to 8 candidate status attributes (4 bytes each).
      // The currently-active attribute has its high byte set to 0x01; the low
      // 3 bytes are the status code (307=OK, 455=Warning, 35=Fault, 303=Off).
      // Walk records on a 40-byte stride and decode them with SBFspot's
      // getattribute() rule.
      const int recordsize = 40;
      bool found_status = false;
      for (int i = 40 + 1; i + recordsize <= packetposition - 3; i += recordsize)
      {
        valuetype = level1packet[i + 1] + level1packet[i + 2] * 256;
        if (valuetype != 0x2148) continue;

        for (int idx = 8; idx < recordsize; idx += 4)
        {
          uint32_t attribute;
          memcpy(&attribute, &level1packet[i + idx], 4);
          uint32_t tag = attribute & 0x00FFFFFF;
          if (tag == 0x00FFFFFE) break; // end-of-attributes marker
          if ((attribute >> 24) == 0x01) // currently-active flag
          {
            devicestatus = tag;
            String status_text;
            switch (devicestatus) {
              case 35:  status_text = "Fault"; break;
              case 303: status_text = "Off"; break;
              case 307: status_text = "OK"; break;
              case 455: status_text = "Warning"; break;
              default:  status_text = String(devicestatus); break;
            }
            logI("Device Status: %s (%u)", status_text.c_str(), devicestatus);
            _client.publish(MQTT_BASE_TOPIC "device_status", status_text, true);
            _client.publish(MQTT_BASE_TOPIC "device_status_code", String(devicestatus), true);
            found_status = true;
            break;
          }
        }
        if (found_status) break;
      }
      if (!found_status) {
        logW("Device status: no active 0x2148 attribute found (packetlen=%d)", packetposition);
      }
      innerstate++;
      break;
    }

  default:
    return true;
  }
  return false;
#endif
}

// Add closing #endif for functions that need them
// (This will be handled by proper function termination)

// Placeholder functions for remaining metrics - to be implemented similarly
bool ESP32_SMA_Inverter::getPowerFactor() { return true; }
bool ESP32_SMA_Inverter::getReactivePower() { return true; }
bool ESP32_SMA_Inverter::getApparentPower() { return true; }
bool ESP32_SMA_Inverter::getGridErrors() { return true; }

bool ESP32_SMA_Inverter::disconnectAndLogoff()
{
  // SBFspot's logoff: cmd 0xFFFD010E followed by 0xFFFFFFFF padding. The
  // inverter doesn't reply, so we send-and-forget then tear down the BT
  // stack. btReset() puts btstate back to STATE_FRESH so the next BTStart()
  // re-runs SerialBT.begin().
  logI("disconnectAndLogoff: sending SMA logoff and closing BT");
  writePacketHeader(level1packet, sixff);
  writeSMANET2PlusPacket(level1packet, 0x08, 0xa0, packet_send_counter, 0x00, 0x03, 0x03);
  writeSMANET2Long(level1packet, 0xFFFD010EUL); // command identifier (LE on the wire)
  writeSMANET2Long(level1packet, 0xFFFFFFFFUL); // padding
  writeSMANET2PlusPacketTrailer(level1packet);
  writePacketLength(level1packet);
  sendPacket(level1packet);
  packet_send_counter++;

  btReset();
  resetSMANetCounters();
  return true;
}

